xiongyu0523/esp-wifi-hosted-driver/common_hardware_code/esp-hosted/host/stm32/driver/spi/spi_drv.h
// Copyright 2015-2021 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

/** prevent recursive inclusion **/
#ifndef __SPI_DRV_H
#define __SPI_DRV_H

#ifdef __cplusplus
extern "C" {
#endif

/** Includes **/
#include "common.h"
#include "stm32l4xx_hal.h"

/** constants/macros **/
#define MAX_NETWORK_INTERFACES  2
#define STA_INTERFACE           "ESP_STATION"
#define SOFTAP_INTERFACE        "ESP_SOFTAP"

#define USR_SPI_CS_Pin                      GPIO_PIN_2
#define USR_SPI_CS_GPIO_Port                GPIOA
#define GPIO_DATA_READY_Pin                 GPIO_PIN_0
#define GPIO_DATA_READY_GPIO_Port           GPIOB
#define GPIO_DATA_READY_EXTI_IRQn           EXTI0_IRQn
#define GPIO_DATA_READY_EXTI_IRQn_Handler   EXTI0_IRQHandler
#define GPIO_HANDSHAKE_Pin                  GPIO_PIN_14
#define GPIO_HANDSHAKE_GPIO_Port            GPIOD
#define GPIO_HANDSHAKE_EXTI_IRQn            EXTI15_10_IRQn
#define GPIO_HANDSHAKE_EXTI_IRQn_Handler    EXTI15_10_IRQHandler
#define GPIO_RESET_Pin                      GPIO_PIN_3
#define GPIO_RESET_GPIO_Port                GPIOA
#define GPIO_SPI_Pins                       (GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6)
#define GPIO_SPI_GPIO_Port                  GPIOA
#define GPIO_SPI_AF                         GPIO_AF5_SPI1

#define SPIn                                SPI1
#define SPIn_IRQn                           SPI1_IRQn
#define SPIn_IRQHandler                     SPI1_IRQHandler
#define __HAL_RCC_SPIn_CLK_ENABLE           __HAL_RCC_SPI1_CLK_ENABLE
#define DMA_REQUEST_SPIn_RX                 DMA_REQUEST_SPI1_RX
#define DMA_REQUEST_SPIn_TX                 DMA_REQUEST_SPI1_TX

typedef enum spi_drv_events_s {
	SPI_DRIVER_ACTIVE
} spi_drv_events_e;

/** Exported Structures **/

/** Exported variables **/

/** Inline functions **/

/** Exported Functions **/
void stm_spi_init(void(*spi_drv_evt_handler)(uint8_t));
stm_ret_t send_to_slave(uint8_t iface_type, uint8_t iface_num,
		uint8_t * wbuffer, uint16_t wlen);

struct esp_private {
	uint8_t     if_type;
	uint8_t     if_num;
	void        *netdev;
};

extern SPI_HandleTypeDef hspi;

#ifdef __cplusplus
}
#endif

#endif
